# 4.9 - Part 1 Intro to Data Visualization with Python

## Contents

#### 1- Import the libraries
#### 2- Import the customer dataset
#### 3 - Wrangle the data in the above dataset
#### 4- Check for and address missing values and duplicates, and convert any mixed-type data
#### 5- Combine the customer data with the rest of the prepared Instacart data
#### 6- Export the dataframe

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Assigning the folder path to a variable
path = r"C:\Users\Toshiba\09-10-2023 Instacart Basket Analysis"

In [3]:
# Creating the customer dataframe with os library
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [53]:
#Exercise 4.9 - Part 1 - Number 4 :

#                 DATA WRANGLING
# Wrangle the data so that it follows consistent logic; 
#for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.


#To Do:

#change 'Surnam' to 'surname'
#Change 'First Name' to 'first_name'
#change 'STATE' to 'state'
#change 'Gender' to lowercase 'gender'
#change 'Age' to lowercase 'age'
#change 'fam_status' to 'marital_status'
#change 'Joining_date' to 'date_joined'
#change 'No_of_dependants' to 'num_of_dependants'
#change 'Income' to'income'
#check for missing values
#check for mixed types
#check for duplicates


# Renaming the columns with proper names

df_cust.rename(columns = {'surnam' : 'surname'}, inplace = True)
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df_cust.rename(columns = {'Last Name' : 'last_name'}, inplace = True)
df_cust.rename(columns = {'State': 'state'}, inplace = True)
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)
df_cust.rename(columns = {'Family_status' : 'marital_status'}, inplace = True)
df_cust.rename(columns = {'Joining_date' : 'date_joined'}, inplace = True)
df_cust.rename(columns = {'No_of_dependants' : 'num_of_dependants'}, inplace = True)
df_cust.rename(columns = {'Income' : 'income'}, inplace = True)

In [54]:
#Checking if the names have been correctly changed

df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_cust.shape

(206209, 10)

In [ ]:
# We can also check if the datatype is changed successfully for order_id by using the below command

#df_cust['User_id'].dtype

In [ ]:
# I dont think that any column needs to be dropped from the customer dataframe. May be , I will need it for analysis in future.

In [ ]:
                            # How to find the missing/blank values in a dataframe is below.

In [40]:
df_cust['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [41]:
df_cust['state'].value_counts(dropna = False)

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [42]:
df_cust['age'].value_counts(dropna = False)

age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

In [46]:
df_cust['date_joined'].value_counts(dropna = False)

date_joined
9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: count, Length: 1187, dtype: int64

In [51]:
df_cust['num_of_dependants'].value_counts(dropna = False)

num_of_dependants
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [55]:
df_cust['marital_status'].value_counts(dropna = False)

marital_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [56]:
df_cust['income'].value_counts(dropna = False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

In [57]:
df_cust['first_name'].value_counts(dropna = False)

first_name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

In [58]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [ ]:
                        # To check for mixed datatype in customer dataframe

In [59]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [ ]:
# this shows first_name contains the mixed data type.

In [60]:
# To find if there are any missing values in customer dataframe
df_cust.isnull().sum()

user_id                  0
first_name           11259
last_name                0
gender                   0
state                    0
age                      0
date_joined              0
num_of_dependants        0
marital_status           0
income                   0
dtype: int64

In [61]:
#finding missing values
df_cust.loc[df_cust['first_name'].isna()]

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [63]:
#addressing missing values is imputation
df_cust['first_name'].fillna('Unknown', inplace = True)

In [64]:
#rechecking missing values
df_cust.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
state                0
age                  0
date_joined          0
num_of_dependants    0
marital_status       0
income               0
dtype: int64

In [65]:
            # to find the duplicate rows
    
df_cust_dups = df_cust_clean[df_cust_clean.duplicated()]

In [66]:
df_cust_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Joining_date, No_of_dependants, Family_status, Income]
Index: []

In [ ]:
# This shows that there are no duplicate rows in the customer dataframe.

In [ ]:
            ## Merge Customer with Instacart

In [67]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [68]:
df_cust.shape

(206209, 10)

In [ ]:
                 ## Exercise 4.9 - Number - 6 - Combining the datasets

In [21]:
# Importing the dataframe orders_products_merged with os library

df_ord_prd_comb1 = pd.read_pickle(os.path.join(path, '02 Data', 
                                   'Prepared Data', 'orders_products_with_flags.pkl'))

In [69]:
df_ord_prd_comb1.head(5)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,mean_order,spending_flag,median_order,customer_flag
0,2539329,1,1,2,8,11.0,196,1,0,Soda,77,7,9.0,10,New customer,6.367797,Low Spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low Spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low Spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low Spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,10,New customer,6.367797,Low Spender,20.0,Regular customer

In [ ]:
# From above , we can see that the two dataframes can be merged on user_id

In [75]:
df_ord_prd_comb1.shape

(32404859, 19)

In [76]:
# Merging the 'df_cust' and 'df_ord_prd_comb1' dataframe

ords_prods_customer_merge = df_ord_prd_comb1.merge(df_cust, on = ['user_id'])

In [77]:
ords_prods_customer_merge.shape

(32404859, 28)

In [78]:
ords_prods_customer_merge.head

<bound method NDFrame.head of           order_id  user_id  order_number  orders_day_of_week  \
0          2539329        1             1                   2
1          2398795        1             2                   3
2           473747        1             3                   3
3          2254736        1             4                   4
4           431534        1             5                   4
...            ...      ...           ...                 ...
32404854    156685   106143            26                   4
32404855    484769    66343             1                   6
32404856   1561557    66343             2                   1
32404857    276317    66343             3                   6
32404858   2922475    66343             4                   1

          order_hour_of_day  days_since_prior_order  product_id  \
0                         8                    11.0         196
1                         7                    15.0         196
2                        12                    21.0         196
3                         7                    29.0         196
4                        15                    28.0         196
...                     ...                     ...         ...
32404854                 23                     5.0       19675
32404855                 11                    11.0       47210
32404856                 11                    30.0       47210
32404857                 15                    19.0       47210
32404858                 12                    30.0       47210

          add_to_cart_order  reordered                 product_name  ...  \
0                         1          0                         Soda  ...
1                         1          1                         Soda  ...
2                         1          1                         Soda  ...
3                         1          1                         Soda  ...
4                         1          1                         Soda  ...
...                     ...        ...                          ...  ...
32404854                  1          1  Organic Raspberry Black Tea  ...
32404855                  1          0  Fresh Farmed Tilapia Fillet  ...
32404856                  1          1  Fresh Farmed Tilapia Fillet  ...
32404857                  1          1  Fresh Farmed Tilapia Fillet  ...
32404858                  1          1  Fresh Farmed Tilapia Fillet  ...

                  customer_flag  first_name  last_name  gender      state  \
0              Regular customer       Linda     Nguyen  Female    Alabama
1              Regular customer       Linda     Nguyen  Female    Alabama
2              Regular customer       Linda     Nguyen  Female    Alabama
3              Regular customer       Linda     Nguyen  Female    Alabama
4              Regular customer       Linda     Nguyen  Female    Alabama
...                         ...         ...        ...     ...        ...
32404854      Frequent customer      Gerald      Yates    Male     Hawaii
32404855  Non-frequent customer  Jacqueline     Arroyo  Female  Tennessee
32404856  Non-frequent customer  Jacqueline     Arroyo  Female  Tennessee
32404857  Non-frequent customer  Jacqueline     Arroyo  Female  Tennessee
32404858  Non-frequent customer  Jacqueline     Arroyo  Female  Tennessee

          age date_joined  num_of_dependants marital_status income
0          31   2/17/2019                  3        married  40423
1          31   2/17/2019                  3        married  40423
2          31   2/17/2019                  3        married  40423
3          31   2/17/2019                  3        married  40423
4          31   2/17/2019                  3        married  40423
...       ...         ...                ...            ...    ...
32404854   25   5/26/2017                  0         single  53755
32404855   22   9/12/2017                  3        married  46151
32404856   22   9/12/2017                  3        married  46151
32404857   22   9/12/2017                  3        married  46151
32404858   22   9/12/2017                  3        married  46151

[32404859 rows x 28 columns]>

In [79]:
# Export the merged dataframe to pkl

ords_prods_customer_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merge.pkl'))